jfishpw/TE_PET_ESP32S3/boxpet/sdkconfig.defaults
# BoxPet 默认工程配置（正点原子 ATK-DNESP32S3B0 / ESP32-S3R8）

# ---- 目标芯片 ----
CONFIG_IDF_TARGET="esp32s3"

# ---- CPU：240MHz 双核 ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---- Flash：16MB，QIO 80MHz ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- PSRAM：八线 80MHz（ESP32-S3R8 板载 8MB） ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# 优先从内部 RAM 分配小对象（≤512B），大缓冲（TLS 握手/录音/HTTP 体）走 PSRAM，
# 避免 TLS 会话内存分配失败（mbedtls_ssl_setup -0x7F00 ALLOC_FAILED）
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
# 运行时大缓冲直接放可执行/静态区（.ext_ram.bss）：本工程 PSRAM 8MB 充足，
# 把 TLS/音频等大数组外移，给内部 RAM 腾出连续空间（xz_task 24KB 栈等）
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# ---- FreeRTOS ----
CONFIG_FREERTOS_HZ=1000

# ---- RTC 慢时钟：RC_FAST/256（主 40MHz 晶振分频，约 68kHz） ----
# 深睡/浅睡计时走 RTC 慢时钟。默认内部 136kHz RC 振荡器随温度漂移（夜间
# 降温 RC 变快），深睡整晚醒来时钟快 1-2 分钟。改用主晶振分频后与晶振同
# 精度（深睡整夜误差 <秒级）。代价：深睡期间 17.5MHz RC_FAST 振荡器常开，
# 深睡电流增加约 0.1mA 级（整夜 ~1mAh，可接受）。
CONFIG_RTC_CLK_SRC_INT_8MD256=y
CONFIG_ESP32S3_RTC_CLK_SRC_INT_8MD256=y

# ---- 电源管理：启用 PM（esp_pm_configure 需要，否则返回 ESP_ERR_NOT_SUPPORTED） ----
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
# 关 Wi-Fi / BT：项目未使用无线协议，默认开启会让 Wi-Fi 任务空转耗电 30~60mA
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_ESP_BT_ENABLED=n
# FreeRTOS tickless idle：Light Sleep 入口
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_SMALL_TEAM_LISTENERS=y

# ---- LVGL 9（组件 lvgl/lvgl@~9.2） ----
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_USE_FLEX=1
CONFIG_LV_USE_USER_DATA=y
# 启用内置 SimSun CJK 兜底（占位字体使用，正式版用 tools/gen_font.ps1 重生成 ui_font_16.c）
CONFIG_LV_FONT_SIMSUN_16_CJK=y

# ---- HTTP 服务器（配网配置页，需求4）----
# 默认 512 字节不够现代浏览器（Chrome 等常发超长 Cookie/Referer 头），提至 2048
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# ---- TLS（聊天/LLM 请求，需求5）----
# 动态缓冲：握手后释放暂存缓冲，显著降低峰值内存；
# 输入缓冲 8192 对 chat/completions JSON 响应足够（应用侧另有 8KB 读取上限）
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
# mbedTLS 大缓冲（SSL in/out、握手临时料）改从 PSRAM 分配：内部 RAM 碎片化时
# 4096+ 级分配会失败（mbedtls_ssl_handshake -0x7F00，实测反复进出对话页后触发）。
# 依赖 SPIRAM_USE_MALLOC=y（本文件上方已开）。
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
